CF/InformationRegisters/ЛогДействийКассираВРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЛогДействийКассираВРМК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УменьшениеСуммыЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеИсходящиеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДействияКассираВРМК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКассираВРМК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗамещаемыйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧекККМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФормыПредварительныхДанных</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/InformationRegisters/ЛогДействийКассираВРМК/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийПодключаемогоОборудования

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПустаяСтрока(Штрихкод) Тогда
		СтруктураПараметровКлиента = ПолученШтрихкодИзСШК(Штрихкод);
		ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоискаПоМагнитномуКоду(ТекКод, ДополнительныеПараметры) Экспорт
	
	Если Не ПустаяСтрока(ТекКод) Тогда
		СтруктураПараметровКлиента = ПолученМагнитныйКод(ТекКод);
		ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораДанныхПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьДанныеПоКодуСервер(Результат);
		ОбработатьДанныеПоКодуКлиент(Результат)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолученМагнитныйКод(МагнитныйКод) Экспорт 
	
	СтруктураРезультат = ПодключаемоеОборудованиеРТВызовСервера.ПолученМагнитныйКод(МагнитныйКод, ЭтотОбъект);
	Возврат СтруктураРезультат;
	
КонецФункции

&НаСервере
Функция ПолученШтрихкодИзСШК(Штрихкод) Экспорт
	
	СтруктураРезультат = ПодключаемоеОборудованиеРТВызовСервера.ПолученШтрихкодИзСШК(Штрихкод, ЭтотОбъект);
	Возврат СтруктураРезультат;
	
КонецФункции

&НаСервере
Процедура ОбработатьДанныеПоКодуСервер(СтруктураРезультат) Экспорт
	
	СтрокаРезультата = СтруктураРезультат.ЗначенияПоиска[0];
	
	Если СтрокаРезультата.Свойство("Карта") Тогда
		
		Если СтрокаРезультата.ЭтоРегистрационнаяКарта Тогда
			Если ЗначениеЗаполнено(СтрокаРезультата.ВладелецКарты)
				И ТипЗнч(СтрокаРезультата.ВладелецКарты) = Тип("СправочникСсылка.Пользователи") Тогда
				Список.Отбор.Элементы.Очистить();
				ГруппаЭлементов = ОбщегоНазначенияРТКлиентСервер.СоздатьГруппуЭлементовОтбора(
									Список.Отбор.Элементы, "ОтборНоменклатура",
									ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
				
				ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
					ГруппаЭлементов,
					"Пользователь",
					СтрокаРезультата.ВладелецКарты);
					
				ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
					ГруппаЭлементов,
					"ЗамещаемыйПользователь",
					СтрокаРезультата.ВладелецКарты);
			КонецЕсли;
		Иначе
			Список.Отбор.Элементы.Очистить();
			ГруппаЭлементов = ОбщегоНазначенияРТКлиентСервер.СоздатьГруппуЭлементовОтбора(
								Список.Отбор.Элементы, "ОтборНоменклатура",
								ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаЭлементов,
				"ВходящиеДанные",
				СтрокаРезультата.Карта);
				
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаЭлементов,
				"ИсходящиеДанные",
				СтрокаРезультата.Карта);
				
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаЭлементов,
				"ДополнительныеИсходящиеДанные",
				СтрокаРезультата.Карта);
				
			Если ТипЗнч(СтрокаРезультата.ВладелецКарты) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
					ГруппаЭлементов,
					"ВходящиеДанные",
					СтрокаРезультата.ВладелецКарты);
					
				ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
					ГруппаЭлементов,
					"ИсходящиеДанные",
					СтрокаРезультата.ВладелецКарты);
					
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтрокаРезультата.Свойство("СерийныйНомер") Тогда
		
		Список.Отбор.Элементы.Очистить();
		ГруппаЭлементов = ОбщегоНазначенияРТКлиентСервер.СоздатьГруппуЭлементовОтбора(
							Список.Отбор.Элементы, "ОтборНоменклатура",
							ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
			ГруппаЭлементов,
			"ВходящаяНоменклатура",
			СтрокаРезультата.Номенклатура);
			
		ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
			ГруппаЭлементов,
			"ИсходящиеДанные",
			СтрокаРезультата.Номенклатура);
		
		ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
			ГруппаЭлементов,
			"ИсходящиеДанные",
			СтрокаРезультата.СерийныйНомер);
			
		ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
			ГруппаЭлементов,
			"ДополнительныеИсходящиеДанные",
			СтрокаРезультата.СерийныйНомер);
			
	Иначе // Номенклатура.
		
		Список.Отбор.Элементы.Очистить();
		ГруппаЭлементов = ОбщегоНазначенияРТКлиентСервер.СоздатьГруппуЭлементовОтбора(
							Список.Отбор.Элементы, "ОтборНоменклатура",
							ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		Если ЗначениеЗаполнено(СтрокаРезультата.Характеристика) Тогда
								
			ГруппаВходящаяНоменклатура = ОбщегоНазначенияРТКлиентСервер.СоздатьГруппуЭлементовОтбора(
								ГруппаЭлементов.Элементы, "ГруппаВходящаяНоменклатура",
								ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
								
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаВходящаяНоменклатура,
				"ВходящаяНоменклатура",
				СтрокаРезультата.Номенклатура);
				
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаВходящаяНоменклатура,
				"ВходящаяХарактеристика",
				СтрокаРезультата.Характеристика);
				
			ГруппаИсходящаяНоменклатура = ОбщегоНазначенияРТКлиентСервер.СоздатьГруппуЭлементовОтбора(
								ГруппаЭлементов.Элементы, "ГруппаИсходящаяНоменклатура",
								ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
								
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаИсходящаяНоменклатура,
				"ИсходящиеДанные",
				СтрокаРезультата.Номенклатура);
				
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаисходящаяНоменклатура,
				"ДополнительныеИсходящиеДанные",
				СтрокаРезультата.Характеристика);
				
		Иначе
			
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаЭлементов,
				"ВходящаяНоменклатура",
				СтрокаРезультата.Номенклатура);
				
			ОбщегоНазначенияРТКлиентСервер.ДобавитьЭлементОтбораВГруппу(
				ГруппаЭлементов,
				"ИсходящиеДанные",
				СтрокаРезультата.Номенклатура);
				
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаРезультата.Свойство("ТекстПредупреждения") Тогда
		СтруктураРезультат.Вставить("ТекстПредупреждения", СтрокаРезультата.ТекстПредупреждения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПоКодуКлиент(СтруктураПараметровКлиента) Экспорт
	
	ОткрытаБлокирующаяФорма = Ложь;
	
	ПодключаемоеОборудованиеРТКлиент.ОбработатьДанныеПоКоду(ЭтотОбъект, СтруктураПараметровКлиента, ОткрытаБлокирующаяФорма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ЧекККМ")
		И ЗначениеЗаполнено(Параметры.Отбор.ЧекККМ) Тогда
		Элементы.ЧекККМ.Видимость = Ложь;
	КонецЕсли;
	
	ПодключаемоеОборудованиеРТВызовСервера.НастроитьПодключаемоеОборудование(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ЛогДействийКассираВРМК.Форма.ФормаСписка.Открытие");

	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиКомандПодключаемогоОборудования

&НаКлиенте
Процедура ПоискПоМагнитномуКоду(Команда)
	
	ОбработкаТабличнойЧастиТоварыКлиент.ВвестиМагнитныйКод(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОбработкаТабличнойЧастиТоварыКлиент.ВвестиШтрихкод(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОчиститьОтбор(Команда)
	
	Список.Отбор.Элементы.Очистить();
	
КонецПроцедуры

#КонецОбласти
